# Task #1
q = int(input("Write number: "))
while q > 0:
    print (q)
    q = q - 1




# Task #2
a = int(input("Write number: "))
b = int(input("Write number: "))

print(b-a+a)
print(a-b+b)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

s = int(input("How old are you? "))


if s >= 18:
    print("Access is allowed")

else:
    print("Sorry, using these resources only from 18 years")





























